content/research/FrozenVoyagers.md
+++
title = "Frozen Voyagers, electroacoustic sounds, high-order ambisonics spatial audio"
author = ["Ambrose Field"]
draft = false
weight = 2012
noauthor = true
nocomment = true
nodate = true
nopaging = true
noread = true
[menu.main]
  weight = 2012
  identifier = "frozen-voyagers-electroacoustic-sounds-high-order-ambisonics-spatial-audio"
+++

_Frozen Voyagers_ premiered at the MUTEK festival, Canada in 2014 in  _cinechamber_ : a spectacular 360 degree surround audio and video auditorium curated by Naut Humon from Recombinant Media Labs. The piece is designed to maximise the spatial qualities of the venue and sound projection system. I'm aiming to try and capture a sense of 'frozen time' through the huge amount of swirling audio activity: standing within this sonic vortex might be a little like being in the eye of the storm: stillness and extreme motion at the same time.

To create an unusual immersive sound spatialisation, I chose a dual-technique approach on this piece. Third order ambisonics helped to generate a sense of defined locations for sounds which needed to be easy to locate. This was combined with first-order ambisonics, chosen to  create a sense of diffuse, seemless ambience. Each technique has its own merits: the more technically 'precise' system of higer order ambisonics is not necessairly musically more useful than first order. As Ambisonics is backwards compatible, it is  straightforward to mix first order techniques and more advanced methods.

The sonic material of piece itself dates from a period of work at Recombinant Media Labs' San Francisco facility in 2006. Here, I installed myself in the 'synth room' at any possible opportunity, being able to use modular surge.

The piece is available as a ten channel version.


## Download {#download}

You can download this multichannel audiowork [here at GitHub](https://github.com/ambrosefield/FIELD%5FMultichannel%5FFrozenVoyagers), under Creative Commons License.